# UndersideSurfaceStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRunType..::..UndersideSurfaceStyle Property
StairsRunType Class See Also
---
The underside surface style of the stairs run, only available for monolithic stairs run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StairsUndersideSurfaceStyle UndersideSurfaceStyle { get; set; }
```

Visual Basic
---
```text
Public Property UndersideSurfaceStyle As StairsUndersideSurfaceStyle
	Get
	Set
```

Visual C++
---
```text
public:
property StairsUndersideSurfaceStyle UndersideSurfaceStyle {
	StairsUndersideSurfaceStyle get ();
	void set (StairsUndersideSurfaceStyle value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable. |

# See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace